Revit 2027 API
WallSweepInfo.IsEqual Method
 Determines if the input object is equivalent to this WallSweepInfo.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsEqual(
	WallSweepInfo toCompare
)
Public Function IsEqual (
	toCompare As WallSweepInfo
) As Boolean
public:
bool IsEqual(
	WallSweepInfo^ toCompare
)
member IsEqual :
        toCompare : WallSweepInfo -> bool
Parameters
toCompare WallSweepInfo
Return Value
Boolean
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
WallSweepInfo Class
Autodesk.Revit.DB Namespace